mintcoke/GD32_RTOS-Flash/Hardware/Application.c
/*
 * Application.c — PLC 命令分发 + PDO 数据映射
 *
 * 应用层核心：解析 PLC 通过 RxPDO 发来的 RFID 命令并执行，
 * 将 RFID 天线数据(RSSI/EPC/NEW)映射到 TxPDO。
 *
 * 命令边沿触发 (s_Armed)：
 *   PLC 每周期都发 RxPDO，CMD 在执行期间保持不变。s_Armed 确保
 *   CMD 从 0 变非零时只执行一次，直到 PLC 清零 CMD(下降沿)才重新武装。
 *   不加此机制同一命令会被 PDO 周期重复执行。
 */

#define _Application_ 1
#include <string.h>
#include "ecat_api.h"
#include "Application.h"
#include "rfid_ecat.h"
#undef _Application_

#include "SSC-Device.h"
#include "ecatslv.h"
#include "GD32Evb.h"
#include <stdio.h>

/* ---- 内部常量 ---- */

/* 单天线 PDO 内部偏移 (相对 pdo_base) */
#define RFID_PDO_RSSI        0
#define RFID_PDO_EPC_LEN     1
#define RFID_PDO_NEW         2
#define RFID_PDO_EPC         3   /* EPC 数据起始 (31 个 UINT16) */

#define RFID_ANT_SETTLE_MS   5U  /* 天线切换稳定时间 */
#define RFID_CMD_DATA_WORDS  128 /* 命令响应最大字数 (256 字节, 受 TxPDO 数据区限制) */
#define RFID_REQ_DATA_WORDS  128 /* 请求数据最大字数 (256 字节, 受 RxPDO 数据区限制) */
#define RFID_CMD_DATA_BYTES  (RFID_CMD_DATA_WORDS * 2)
#define RFID_REQ_DATA_BYTES  (RFID_REQ_DATA_WORDS * 2)

/* 各存储区读写上限(字)。标准上限放行，越界写由标签返回错误码如实上报。
 * RFU: 标准固定 64 位=4 字，写禁止。
 * EPC: 标准上限 31 字(PC 5 位编码)，前两字 PC/CRC 禁写。
 * TID/USER: 标准未限定，固件按 PDO 数据区 128 字限(单次命令传输上限)。 */
#define RFID_RFU_MAX_WORDS     4U
#define RFID_EPC_MAX_WORDS     31U
#define RFID_TID_MAX_WORDS     128U
#define RFID_USER_MAX_WORDS    128U
#define RFID_EPC_FIXED_WORDS   8U   /* READ_EPC_USER_ALL 每通道 EPC 固定读 8 字(不足补0, 超出截断), 保证每通道固定长度 */

/* EPC 区布局: [PC(1word,addr=1)][CRC(1word)][EPC数据(addr>=2)] */
#define RFID_EPC_PC_ADDR     1U
#define RFID_EPC_DATA_ADDR   2U

#define RFID_RAW_TIMEOUT_MS  500U

#define RFID_EPC_SELECT_PTR  0x00000020UL /* EPC 选择掩码起始位 (第32位) */
#define RFID_SELECT_MODE_OFF 0x01U

/* ---- 数据转换辅助 ---- */

/* 字节数组打包为 UINT16(大端)。byte_idx 越界补零。
 * 用于把 uint8_t 写入 DI() (PDO 按 UINT16 对齐)。 */
static uint16_t RFID_PackBytes(const uint8_t *data, uint16_t len, uint16_t byte_idx)
{
    uint16_t w = 0;

    if (byte_idx < len) {
        w = (uint16_t)data[byte_idx] << 8;
        if ((uint16_t)(byte_idx + 1U) < len) {
            w |= data[byte_idx + 1U];
        } else {
            w >>= 8;  /* 仅 1 字节放低位: 0x01 → 0x0001 */
        }
    }
    return w;
}

static uint16_t RFID_ReadU16BE(const uint8_t *data)
{
    return ((uint16_t)data[0] << 8) | data[1];
}

static void RFID_WriteU16BE(uint8_t *data, uint16_t value)
{
    data[0] = (uint8_t)(value >> 8);
    data[1] = (uint8_t)value;
}

static void RFID_WriteU32BE(uint8_t *data, uint32_t value)
{
    data[0] = (uint8_t)(value >> 24);
    data[1] = (uint8_t)(value >> 16);
    data[2] = (uint8_t)(value >> 8);
    data[3] = (uint8_t)value;
}

/* 从 RxPDO 解包字节数据。DO(pdo_base+i) 拆为高字节在前，最多 60 字节。 */
static void RFID_UnpackPdoBytes(uint16_t pdo_base, uint16_t byte_len, uint8_t *data)
{
    uint16_t out = 0;

    for (uint16_t i = 0; i < RFID_REQ_DATA_WORDS && out < byte_len; i++) {
        uint16_t w = DO(pdo_base + i);
        data[out++] = (uint8_t)(w >> 8);
        if (out < byte_len) {
            data[out++] = (uint8_t)w;
        }
    }
}

/* ---- PDO 数据写入辅助 ---- */

/* 命令响应写入 TxPDO: DI(LEN)=长度, DI(DATA+0..31)=内容(大端) */
static void RFID_WriteCmdDataToPdo(const uint8_t *data, uint16_t byte_len)
{
    if (byte_len > RFID_CMD_DATA_BYTES) {
        byte_len = RFID_CMD_DATA_BYTES;
    }

    DI(TX_RFID_CMD_DATA_LEN) = byte_len;
    for (uint16_t i = 0; i < RFID_CMD_DATA_WORDS; i++) {
        DI(TX_RFID_CMD_DATA + i) = RFID_PackBytes(data, byte_len, (uint16_t)(i * 2U));
    }
}

static void RFID_ClearCmdDataPdo(void)
{
    DI(TX_RFID_CMD_DATA_LEN) = 0;
    for (uint16_t i = 0; i < RFID_CMD_DATA_WORDS; i++) {
        DI(TX_RFID_CMD_DATA + i) = 0;
    }
}

/* ---- PLC 命令包装 (简化 RFID_Command 调用) ---- */

/* 通用：发命令+数据，收响应，成功时写入 TxPDO */
static int RFID_PlcCommand(uint8_t cmd_id,
                           const uint8_t *tx_data,
                           uint16_t tx_len,
                           uint8_t *rx_data,
                           uint16_t *rx_len)
{
    int ret = RFID_Command(cmd_id, tx_data, tx_len, rx_data, rx_len, RFID_RAW_TIMEOUT_MS);

    if (ret == RFID_RET_OK) {
        RFID_WriteCmdDataToPdo(rx_data, *rx_len);
    }
    return ret;
}

static int RFID_PlcCommandNoParam(uint8_t cmd_id, uint8_t *buf)
{
    uint16_t rsp_len = RFID_CMD_DATA_BYTES;
    return RFID_PlcCommand(cmd_id, NULL, 0U, buf, &rsp_len);
}

static int RFID_PlcCommandU8(uint8_t cmd_id, uint8_t value, uint8_t *buf)
{
    uint16_t rsp_len = RFID_CMD_DATA_BYTES;
    buf[0] = value;
    return RFID_PlcCommand(cmd_id, buf, 1U, buf, &rsp_len);
}

/* 检查响应首字节状态码 (0=成功, 非0=模块错误)，成功时写 TxPDO */
static int RFID_PlcCommandStatusOnly(uint8_t cmd_id, const uint8_t *tx_data, uint16_t tx_len, uint8_t *buf)
{
    uint16_t rsp_len = RFID_CMD_DATA_BYTES;
    int ret;

    ret = RFID_Command(cmd_id, tx_data, tx_len, buf, &rsp_len, RFID_RAW_TIMEOUT_MS);
    if (ret == RFID_RET_OK) {
        RFID_WriteCmdDataToPdo(buf, rsp_len);
        if (rsp_len < 1U) {
            rfid_last_result = RFID_RET_FRAME_ERR;
            return RFID_RET_FRAME_ERR;
        }
        if (buf[0] != 0U) {
            rfid_last_error = buf[0];
            rfid_last_result = RFID_RET_MODULE_ERR;
            return RFID_RET_MODULE_ERR;
        }
    }
    return ret;
}

static int RFID_PlcCommandStatusU8(uint8_t cmd_id, uint8_t value, uint8_t *buf)
{
    buf[0] = value;
    return RFID_PlcCommandStatusOnly(cmd_id, buf, 1U, buf);
}

static int RFID_PlcCommandStatusU16(uint8_t cmd_id, uint16_t value, uint8_t *buf)
{
    RFID_WriteU16BE(buf, value);
    return RFID_PlcCommandStatusOnly(cmd_id, buf, 2U, buf);
}

/* 功率参数转换: 1~33 视为 dBm(×100, 如 30→3000); >33 直接用(已是内部单位) */
static uint16_t RFID_PlcPowerParam(uint16_t value)
{
    if (value <= 33U) {
        return (uint16_t)(value * 100U);
    }
    return value;
}

/* ---- 标签选择 (写操作前需先选目标标签) ---- */

/* 选择指定 EPC 的标签。
 * Select 参数: [Target/Action/MemBank][Ptr(4B)][MaskLen(bits)][MaskLen(bytes)][MaskData]
 * 选 EPC 区从第 32 位起、长 byte_len*8 位的标签。 */
static int RFID_PlcSelectEpcBytes(const uint8_t *epc, uint16_t byte_len, uint8_t *buf)
{
    if (epc == NULL || byte_len == 0U || byte_len > 31U) {
        rfid_last_result = RFID_RET_FRAME_ERR;
        return RFID_RET_FRAME_ERR;
    }

