mintcoke/GD32_RTOS-Flash/Hardware/Application.c
    buf[0] = 0x01U; /* MemBank=EPC */
    RFID_WriteU32BE(&buf[1], RFID_EPC_SELECT_PTR);
    buf[5] = (uint8_t)(byte_len * 8U);
    buf[6] = 0x00U;
    memcpy(&buf[7], epc, byte_len);
    return RFID_PlcCommandStatusOnly(RFID_CMD_SET_SELECT,
                                     buf,
                                     (uint16_t)(7U + byte_len),
                                     buf);
}

static int RFID_PlcSelectEpcFromPdo(uint16_t byte_len, uint8_t *buf)
{
    uint8_t epc[RFID_REQ_DATA_BYTES];
    RFID_UnpackPdoBytes(RX_RFID_DATA, byte_len, epc);
    return RFID_PlcSelectEpcBytes(epc, byte_len, buf);
}

/* 写 EPC 成功后更新对应天线缓存，避免下次扫描读到旧数据 */
static void RFID_UpdateEpcCacheFromWrite(uint8_t ant,
                                         uint16_t actual_addr,
                                         const uint8_t *data,
                                         uint16_t byte_len)
{
    uint16_t offset;
    uint16_t copy_len;
    uint8_t idx;

    if (ant < 1U || ant > RFID_ANT_COUNT ||
        actual_addr < RFID_EPC_DATA_ADDR ||
        data == 0 || byte_len == 0U) {
        return;
    }

    offset = (uint16_t)((actual_addr - RFID_EPC_DATA_ADDR) * 2U);
    if (offset >= RFID_EPC_BYTES) {
        return;
    }

    copy_len = byte_len;
    if ((uint16_t)(offset + copy_len) > RFID_EPC_BYTES) {
        copy_len = (uint16_t)(RFID_EPC_BYTES - offset);
    }

    idx = (uint8_t)(ant - 1U);
    memcpy(&g_RfidEpc[idx][offset], data, copy_len);
    if (g_RfidEpcLen[idx] < (uint8_t)(offset + copy_len)) {
        g_RfidEpcLen[idx] = (uint8_t)(offset + copy_len);
    }
    g_RfidNew[idx] = 1U;
}

/* 确保目标标签已选。缓存无 EPC 时先 Inventory 获取，再发 Select。 */
static int RFID_PlcEnsureSelected(uint8_t ant, uint8_t *buf)
{
    rfid_tag_t tag;
    uint8_t idx;
    int ret;

    if (ant < 1U || ant > RFID_ANT_COUNT) {
        return RFID_RET_OK;
    }

    idx = (uint8_t)(ant - 1U);
    if (g_RfidEpcLen[idx] == 0U) {
        ret = RFID_Inventory(&tag);
        if (ret != RFID_RET_OK) {
            return ret;
        }

        g_RfidRssi[idx] = tag.rssi;
        g_RfidEpcLen[idx] = tag.epc_len;
        memset(g_RfidEpc[idx], 0, RFID_EPC_BYTES);
        memcpy(g_RfidEpc[idx], tag.epc, tag.epc_len);
        g_RfidNew[idx] = 1U;
    }

    return RFID_PlcSelectEpcBytes(g_RfidEpc[idx], g_RfidEpcLen[idx], buf);
}

/* 写标签：words 多少直接单次写多少，模块拒写由 RFID_WriteTag 如实返回错误码。 */
static int RFID_WriteTagChunked(uint8_t bank, uint16_t addr, uint16_t words, const uint8_t *data)
{
    return RFID_WriteTag(bank, addr, words, data);
}

/* 阻塞延时(天线切换稳定)。用 ECAT_KeepAlive 保活。 */
static void RFID_EcatDelayMs(uint32_t ms)
{
    extern volatile uint32_t g_SysTickCnt;
    uint32_t deadline = g_SysTickCnt + ms;

    while ((int32_t)(g_SysTickCnt - deadline) < 0) {
        ECAT_KeepAlive();
    }
}

/* 单天线数据 → TxPDO。在 APPL_UpdateTxPdo() 中调用。 */
static void RFID_MapAntennaToPdo(uint8_t ant_idx, uint16_t pdo_base)
{
    extern uint8_t  g_RfidRssi[RFID_ANT_COUNT];
    extern uint8_t  g_RfidEpcLen[RFID_ANT_COUNT];
    extern uint8_t  g_RfidNew[RFID_ANT_COUNT];
    extern uint8_t  g_RfidEpc[RFID_ANT_COUNT][RFID_EPC_BYTES];

    DI(pdo_base + RFID_PDO_RSSI) = g_RfidRssi[ant_idx];
    DI(pdo_base + RFID_PDO_EPC_LEN) = g_RfidEpcLen[ant_idx];
    DI(pdo_base + RFID_PDO_NEW) = g_RfidNew[ant_idx];

    for (int i = 0; i < 31; i++) {
        uint16_t byte_idx = (uint16_t)(i * 2);
        DI(pdo_base + RFID_PDO_EPC + i) =
            RFID_PackBytes(g_RfidEpc[ant_idx], g_RfidEpcLen[ant_idx], byte_idx);
    }
}

/* 一键读三通道 EPC+USER。
 * 每通道: [EPC状态][EPC N字][USER状态][USER WORDS字] 依次写入 TxPDO 响应区。
 * EPC 长度 N 取自标签 PC 字高 5 位(自动适配); USER 读 ADDR 起 WORDS 字。
 * 失败通道状态写错误码、数据填 0，继续下一通道。总长超 128 字截断。
 * USER 区读前用各通道缓存 EPC 选标签(无缓存先 Inventory)。 */
static int RFID_ReadEpcUserAll(uint16_t user_addr, uint16_t user_words, uint8_t *buf)
{
    uint16_t out_word = 0;   /* TxPDO 响应区当前写入字偏移(相对 TX_RFID_CMD_DATA) */
    uint16_t user_bytes = (uint16_t)(user_words * 2U);

    for (uint8_t ant = 1U; ant <= RFID_ANT_COUNT; ant++) {
        uint16_t epc_words = 0;
        uint8_t epc_status = 0;
        uint8_t user_status = 0;
        uint8_t epc_buf[RFID_EPC_BYTES + 2];

        RFID_SetAntenna(ant);
        RFID_EcatDelayMs(RFID_ANT_SETTLE_MS);

        /* --- 读 EPC: 固定读 8 字, 失败填 0 (保证每通道固定长度好解析) --- */
        {
            uint8_t epc_len = RFID_EPC_FIXED_WORDS;
            memset(epc_buf, 0, sizeof(epc_buf));
            if (RFID_ReadTag(RFID_BANK_EPC, RFID_EPC_PC_ADDR, 1U, epc_buf) == RFID_RET_OK) {
                uint16_t pc = RFID_ReadU16BE(epc_buf);
                epc_words = (uint16_t)((pc >> 11) & 0x1FU);
                if (epc_words == 0U || epc_words > RFID_EPC_MAX_WORDS) {
                    epc_words = 0;
                }
                memset(epc_buf, 0, epc_len * 2U);
                if (epc_words > 0U) {
                    if (RFID_ReadTag(RFID_BANK_EPC, RFID_EPC_DATA_ADDR, epc_words, epc_buf) != RFID_RET_OK) {
                        epc_status = (rfid_last_error != 0U) ? rfid_last_error : 0xFFU;
                    }
                }
            } else {
                epc_status = (rfid_last_error != 0U) ? rfid_last_error : 0xFFU;
            }
        }

        /* --- 读 USER: 先选标签(用缓存 EPC), 再读 --- */
        if (RFID_PlcEnsureSelected(ant, buf) == RFID_RET_OK) {
            if (RFID_ReadTag(RFID_BANK_USER, user_addr, user_words, buf) != RFID_RET_OK) {
                user_status = (rfid_last_error != 0U) ? rfid_last_error : 0xFFU;
            }
        } else {
            user_status = (rfid_last_error != 0U) ? rfid_last_error : 0xFFU;
        }

        /* --- 写入 TxPDO: [EPC状态][EPC 固定8字][USER状态][USER WORDS字] --- */
        /* 每通道固定长度 = 1 + RFID_EPC_FIXED_WORDS + 1 + user_words, PLC 按固定偏移读 */
        /* EPC 状态字 */
        if (out_word < RFID_CMD_DATA_WORDS) {
            DI(TX_RFID_CMD_DATA + out_word) = epc_status;
            out_word++;
        }
        /* EPC 数据(固定 RFID_EPC_FIXED_WORDS 字, 不足补 0) */
        {
            uint16_t copy_w = epc_words;
            if (copy_w > RFID_EPC_FIXED_WORDS) {
                copy_w = RFID_EPC_FIXED_WORDS;
            }
            for (uint16_t i = 0; i < RFID_EPC_FIXED_WORDS && out_word < RFID_CMD_DATA_WORDS; i++) {
                DI(TX_RFID_CMD_DATA + out_word) = (i < copy_w)
                    ? RFID_PackBytes(epc_buf, (uint16_t)(epc_words * 2U), (uint16_t)(i * 2U))
                    : 0;
                out_word++;
            }
        }
        /* USER 状态字 */
        if (out_word < RFID_CMD_DATA_WORDS) {
            DI(TX_RFID_CMD_DATA + out_word) = user_status;
            out_word++;
        }
        /* USER 数据(成功才有数据, 失败填 0) */
        for (uint16_t i = 0; i < user_words && out_word < RFID_CMD_DATA_WORDS; i++) {
            DI(TX_RFID_CMD_DATA + out_word) = (user_status == 0U)
                ? RFID_PackBytes(buf, user_bytes, (uint16_t)(i * 2U))
                : 0;
            out_word++;
        }
    }

    DI(TX_RFID_CMD_DATA_LEN) = (uint16_t)(out_word * 2U);
    return RFID_RET_OK;
}

/* PLC 命令分发核心。从 RxPDO 读命令执行，结果写 TxPDO。
 * 返回 1=处理中(主循环跳过 RFID_Scan), 0=无命令(继续 Scan)。
 * 边沿触发见文件头说明。
 *
 * s_Armed 状态机(防重复执行):
 *   - CMD 从 0 变非0 且 s_Armed=1 → 执行命令, s_Armed 置 0(锁定)
 *   - CMD 保持非0 且 s_Armed=0   → 跳过(同一命令不重复执行)
 *   - CMD 变回 0                  → s_Armed 置 1(重新武装, 准备下一条)
 * 这样 PLC 每周期都发 RxPDO, 但同一命令只执行一次, 直到 PLC 清零 CMD。 */
uint8_t RFID_EcatCmdTask(void)
{
    static uint8_t s_Armed = 1U;   /* 1=等待新命令, 0=命令锁定中 */
    uint8_t buf[RFID_CMD_DATA_BYTES];
    uint16_t cmd = DO(RX_RFID_CMD);       /* 读取命令码 */
    uint16_t ant = DO(RX_RFID_ANT);       /* 读取天线号 */
    uint16_t addr = DO(RX_RFID_ADDR);     /* 读取地址/参数 */
    uint16_t words = DO(RX_RFID_WORDS);   /* 读取字数/参数 */
    int ret = RFID_RET_FRAME_ERR;

    /* RFID 软复位进行中：模块正在重启, 不发任何阻塞命令, 返回 BUSY 让主循环也跳过扫描。
     * 若此时 PLC 发了命令, 回显命令码并报 BUSY, 让 PLC 知道暂不可用。 */
    if (g_RfidWdTriggered != 0U) {
        if (cmd != RFID_PLC_CMD_NONE) {
            DI(TX_RFID_CMD_ECHO) = cmd;
            DI(TX_RFID_CMD_STATUS) = RFID_PLC_STATUS_BUSY;
            DI(TX_RFID_CMD_RESULT) = 0U;
        }
        return 1U;
    }

    /* 无命令: 保持 IDLE 状态, 重新武装 s_Armed, 主循环继续做自动扫描。
     * 注意: 若上条命令还在 BUSY(理论上不该出现), 不强行覆盖成 IDLE。 */
    if (cmd == RFID_PLC_CMD_NONE) {
        if (DI(TX_RFID_CMD_STATUS) != RFID_PLC_STATUS_BUSY) {
            DI(TX_RFID_CMD_STATUS) = RFID_PLC_STATUS_IDLE;
        }
        s_Armed = 1U;
        return 0U;
    }

