mintcoke/GD32_RTOS-Flash/Hardware/Application.c
    /* 命令锁定中(s_Armed=0): CMD 还没被 PLC 清零, 同一命令不重复执行, 直接返回 */
    if (s_Armed == 0U) {
        return 0U;
    }
    s_Armed = 0U;   /* 锁定, 直到 CMD 清零才重新武装 */

    /* 设置响应头: 回显命令码, 置 BUSY, 清结果码和数据区。
     * PLC 据此知道命令已被接收, 轮询 STATUS 等待 OK/ERROR。 */
    DI(TX_RFID_CMD_ECHO) = cmd;
    DI(TX_RFID_CMD_STATUS) = RFID_PLC_STATUS_BUSY;
    DI(TX_RFID_CMD_RESULT) = 0;
    RFID_ClearCmdDataPdo();

    /* 切换天线(若指定了合法天线号), 等待稳定后再执行命令 */
    if (ant >= 1U && ant <= RFID_ANT_COUNT) {
        RFID_SetAntenna((uint8_t)ant);
        RFID_EcatDelayMs(RFID_ANT_SETTLE_MS);
    }

    /* ---- 命令分发 ---- */
    switch (cmd) {

    case RFID_PLC_CMD_GET_INFO:
        if (words > 1U) {
            words = 1U;
        }
        ret = RFID_PlcCommandU8(RFID_CMD_READ_INFO, (uint8_t)words, buf);
        break;

    case RFID_PLC_CMD_READ_TID:
        if (words == 0U) {
            words = 6U;
        }
        if (words > RFID_TID_MAX_WORDS) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            ret = RFID_ReadTag(RFID_BANK_TID, addr, words, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteCmdDataToPdo(buf, (uint16_t)(words * 2U));
            }
        }
        break;

    case RFID_PLC_CMD_READ_USER:
        if (words == 0U) {
            words = 6U;
        }
        if (words > RFID_USER_MAX_WORDS) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            ret = RFID_PlcEnsureSelected((uint8_t)ant, buf);
            if (ret == RFID_RET_OK) {
                ret = RFID_ReadTag(RFID_BANK_USER, addr, words, buf);
                if (ret == RFID_RET_OK) {
                    RFID_WriteCmdDataToPdo(buf, (uint16_t)(words * 2U));
                }
            }
        }
        break;

    case RFID_PLC_CMD_READ_RFU:     /* 读 RFU 区(密码)，最多 4 字，写禁止 */
        if (words == 0U || words > RFID_RFU_MAX_WORDS || addr >= RFID_RFU_MAX_WORDS) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            ret = RFID_ReadTag(RFID_BANK_RFU, addr, words, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteCmdDataToPdo(buf, (uint16_t)(words * 2U));
            }
        }
        break;

    case RFID_PLC_CMD_READ_EPC_USER_ALL:  /* 一键读三通道 EPC+USER */
        if (words == 0U || words > 32U) {
            ret = RFID_RET_FRAME_ERR;   /* USER 字数 1~32, 保证三通道≤128 字 */
        } else {
            ret = RFID_ReadEpcUserAll(addr, words, buf);
        }
        break;

    case RFID_PLC_CMD_WRITE_USER:
        if (words == 0U || words > RFID_USER_MAX_WORDS) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint16_t write_bytes = (uint16_t)(words * 2U);
            ret = RFID_PlcEnsureSelected((uint8_t)ant, buf);
            if (ret == RFID_RET_OK) {
                RFID_UnpackPdoBytes(RX_RFID_DATA, write_bytes, buf);
                RFID_WriteCmdDataToPdo(buf, write_bytes);
                ret = RFID_WriteTagChunked(RFID_BANK_USER, addr, words, buf);
                /* 回读校验 */
                {
                    uint8_t rd_buf[RFID_REQ_DATA_BYTES];
                    int rd_ret = RFID_ReadTag(RFID_BANK_USER, addr, words, rd_buf);
                    if (rd_ret == RFID_RET_OK && memcmp(rd_buf, buf, write_bytes) == 0) {
                        ret = RFID_RET_OK;
                    } else {
                        ret = RFID_RET_FRAME_ERR;
                    }
                }
            }
        }
        break;

    case RFID_PLC_CMD_WRITE_EPC:
        /* EPC 区前两字 PC/CRC 禁写，addr>=2。总分段<=31字(标准上限 PC 5 位编码)。
         * 单次命令受 RxPDO 数据区 64 字限制。越界(addr+words>33)报错，
         * 标签容量不足由标签返回错误码如实上报。 */
        if (words == 0U || words > RFID_REQ_DATA_WORDS
            || addr < RFID_EPC_DATA_ADDR
            || (uint16_t)(addr + words) > (RFID_EPC_DATA_ADDR + RFID_EPC_MAX_WORDS)) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint8_t write_buf[RFID_REQ_DATA_BYTES];
            uint16_t actual_addr = addr;
            uint16_t write_bytes = (uint16_t)(words * 2U);
            ret = RFID_PlcEnsureSelected((uint8_t)ant, buf);
            if (ret == RFID_RET_OK) {
                RFID_UnpackPdoBytes(RX_RFID_DATA, write_bytes, write_buf);
                RFID_WriteCmdDataToPdo(write_buf, write_bytes);
                ret = RFID_WriteTagChunked(RFID_BANK_EPC, actual_addr, words, write_buf);
                if (ret == RFID_RET_OK) {
                    RFID_UpdateEpcCacheFromWrite((uint8_t)ant, actual_addr, write_buf, write_bytes);
                    if (ant >= 1U && ant <= RFID_ANT_COUNT && g_RfidEpcLen[ant - 1U] > 0U) {
                        (void)RFID_PlcSelectEpcBytes(g_RfidEpc[ant - 1U], g_RfidEpcLen[ant - 1U], buf);
                    }
                    RFID_WriteCmdDataToPdo(write_buf, write_bytes);
                    rfid_last_error = 0U;
                    rfid_last_result = RFID_RET_OK;
                }
            }
        }
        break;

    case RFID_PLC_CMD_SET_EPC_LEN:    /* 改 EPC 长度 = 改 PC 字高 5 位，1~31 字 */
        if (words == 0U || words > RFID_EPC_MAX_WORDS) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            ret = RFID_PlcEnsureSelected((uint8_t)ant, buf);
            if (ret == RFID_RET_OK) {
                ret = RFID_ReadTag(RFID_BANK_EPC, RFID_EPC_PC_ADDR, 1U, buf);
                if (ret == RFID_RET_OK) {
                    uint16_t pc = RFID_ReadU16BE(buf);
                    pc = (uint16_t)((pc & 0x07FFU) | ((words & 0x1FU) << 11));
                    RFID_WriteU16BE(buf, pc);
                    RFID_WriteCmdDataToPdo(buf, 2U);
                    ret = RFID_WriteTag(RFID_BANK_EPC, RFID_EPC_PC_ADDR, 1U, buf);
                }
            }
        }
        break;

    case RFID_PLC_CMD_SET_POWER:
        {
            uint16_t pwr = RFID_PlcPowerParam(words);
            ret = RFID_PlcCommandStatusU16(RFID_CMD_SET_POWER, pwr, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, pwr);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

