mintcoke/GD32_RTOS-Flash/Hardware/Application.c
    case RFID_PLC_CMD_GET_POWER:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_POWER, buf);
        break;

    case RFID_PLC_CMD_SET_REGION:
        if (words > 0xFFU) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint8_t region = (uint8_t)words;
            ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_REGION, region, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)region);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_REGION:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_REGION, buf);
        break;

    case RFID_PLC_CMD_SET_CHANNEL:
        if (words > 0xFFU) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint8_t ch = (uint8_t)words;
            ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_CHANNEL, ch, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)ch);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_CHANNEL:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_CHANNEL, buf);
        break;

    case RFID_PLC_CMD_SET_HOP:
        {
            uint8_t hop = (words == 0U) ? 0x00U : 0xFFU;
            ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_HOP, hop, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)hop);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_HOP:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_HOP, buf);
        break;

    case RFID_PLC_CMD_SET_MODE:
        if (words > 1U) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint8_t mode = (uint8_t)words;
            ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_MODE, mode, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)mode);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_MODE:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_MODE, buf);
        break;

    case RFID_PLC_CMD_INVENTORY:
        {
            rfid_tag_t tag;
            ret = RFID_Inventory(&tag);
            if (ret == RFID_RET_OK) {
                buf[0] = tag.rssi;
                RFID_WriteU16BE(&buf[1], tag.pc);
                buf[3] = tag.epc_len;
                memcpy(&buf[4], tag.epc, tag.epc_len);
                RFID_WriteCmdDataToPdo(buf, (uint16_t)(4U + tag.epc_len));
            }
        }
        break;

    case RFID_PLC_CMD_STOP_POLL:
        ret = RFID_PlcCommandStatusOnly(RFID_CMD_STOP_POLL, NULL, 0U, buf);
        break;

    case RFID_PLC_CMD_SET_CH_LIST:
        if (words > RFID_REQ_DATA_BYTES) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint8_t cnt = (uint8_t)words;
            buf[0] = cnt;
            RFID_UnpackPdoBytes(RX_RFID_DATA, cnt, &buf[1]);
            ret = RFID_PlcCommandStatusOnly(RFID_CMD_SET_CH_LIST, buf, (uint16_t)(cnt + 1U), buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)cnt);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_CH_LIST:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_CH_LIST, buf);
        break;

    case RFID_PLC_CMD_SET_RX:
        {
            uint8_t rx_params[4];
            RFID_UnpackPdoBytes(RX_RFID_DATA, 4U, rx_params);
            ret = RFID_PlcCommandStatusOnly(RFID_CMD_SET_RX, rx_params, 4U, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteCmdDataToPdo(rx_params, 4U);
            }
        }
        break;

    case RFID_PLC_CMD_GET_RX:
        ret = RFID_PlcCommandNoParam(RFID_CMD_GET_RX, buf);
        break;

    case RFID_PLC_CMD_TEST_RSSI:
        ret = RFID_PlcCommandNoParam(RFID_CMD_TEST_RSSI, buf);
        break;

    case RFID_PLC_CMD_SET_CARRIER:
        {
            uint8_t carrier = (words == 0U) ? 0x00U : 0xFFU;
            ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_CARRIER, carrier, buf);
            if (ret == RFID_RET_OK) {
                RFID_WriteU16BE(buf, (uint16_t)carrier);
                RFID_WriteCmdDataToPdo(buf, 2U);
            }
        }
        break;

    case RFID_PLC_CMD_RESET:
        RFID_Reset();
        ret = RFID_RET_OK;
        break;

    case RFID_PLC_CMD_SELECT_EPC:
        if (words == 0U) {
            words = (ant >= 1U && ant <= RFID_ANT_COUNT) ? g_RfidEpcLen[ant - 1U] : 0U;
            if (words > 0U) {
                ret = RFID_PlcSelectEpcBytes(g_RfidEpc[ant - 1U], words, buf);
            } else {
                ret = RFID_RET_FRAME_ERR;
            }
        } else {
            ret = RFID_PlcSelectEpcFromPdo(words, buf);
        }
        break;

    case RFID_PLC_CMD_CLEAR_SELECT:
        ret = RFID_PlcCommandStatusU8(RFID_CMD_SET_SEL_MODE, RFID_SELECT_MODE_OFF, buf);
        break;

    case RFID_PLC_CMD_RAW:            /* 原始命令直发模块 */
        if (addr > 0xFFU || words > RFID_REQ_DATA_BYTES) {
            ret = RFID_RET_FRAME_ERR;
        } else {
            uint16_t rsp_len = RFID_CMD_DATA_BYTES;
            RFID_UnpackPdoBytes(RX_RFID_DATA, words, buf);
            ret = RFID_Command((uint8_t)addr, buf, words, buf, &rsp_len, RFID_RAW_TIMEOUT_MS);
            RFID_WriteCmdDataToPdo(buf, rsp_len);
        }
        break;

    default:
        ret = RFID_RET_FRAME_ERR;
        break;
    }

    /* ---- 结果写 TxPDO ----
     * 命令执行完毕, 根据 ret 更新 STATUS/RESULT:
     *   成功: STATUS=OK, RESULT=0
     *   失败: STATUS=ERROR, RESULT 优先用模块错误码(rfid_last_error),
     *         没有模块错误码时用驱动错误码取反(-ret, 如 FRAME_ERR=-3 → 3) */
    if (ret == RFID_RET_OK) {
        DI(TX_RFID_CMD_STATUS) = RFID_PLC_STATUS_OK;
        DI(TX_RFID_CMD_RESULT) = 0;
    } else {
        DI(TX_RFID_CMD_STATUS) = RFID_PLC_STATUS_ERROR;
        DI(TX_RFID_CMD_RESULT) = (uint16_t)((rfid_last_error != 0U) ? rfid_last_error : (uint16_t)(-ret));
    }
    return 1U;   /* 命令处理中, 主循环跳过 RFID_Scan */
}

/* 周期任务(每 PDO 周期一次)。递增心跳 → DI(0)，映射 3 天线数据到 TxPDO。 */
void APPL_UpdateTxPdo(void)
{
    static uint16_t s_Counter = 0;
    static const uint16_t rfid_pdo_base[RFID_ANT_COUNT] = {
        TX_RFID1_RSSI,
        TX_RFID2_RSSI,
        TX_RFID3_RSSI
    };

    s_Counter++;
    DI(0) = s_Counter;

    for (uint8_t ant = 0; ant < RFID_ANT_COUNT; ant++) {
        RFID_MapAntennaToPdo(ant, rfid_pdo_base[ant]);
    }
}

/* 安全输出 (进入 SAFE-OP 时调用)。当前无需求，保留空实现。 */
void APPL_SafeOutput(void)
{
}
